{
  "backend/main.mo": "Motoko canister handling application creation and retrieval with access control, storing applications in a Map and enforcing user/admin permissions.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global stylesheet defining a blue-themed OKLCH color system for light and dark modes.",
  "frontend/index.html": "HTML entry point configuring metadata and setting the document title to MD SUHEL - Certificate Services.",
  "frontend/src/App.tsx": "Main React app configuring layout and application routes with TanStack Router.",
  "frontend/src/components/Footer.tsx": "Footer component showing MD SUHEL copyright and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Header with MD SUHEL branding, generated logo, navigation links, and Internet Identity auth controls.",
  "frontend/src/components/RequireLoginNotice.tsx": "Alert component prompting users to sign in with a quick login button.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching the backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch a user's applications and a specific application by ID using an actor instance.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark blue-themed UI palettes.",
  "frontend/src/lib/applicationFormMapping.ts": "Maps frontend form fields into the backend ApplicationForm format, including gender and nationality conversions.",
  "frontend/src/lib/formatters.ts": "Contains helpers to format timestamps into readable dates and to format application numbers with a prefix.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ApplicationDetailPage.tsx": "Displays detailed information for a single application, including loading and error states.",
  "frontend/src/pages/MyApplicationsPage.tsx": "Shows a user's list of submitted applications with authentication, loading, error, and empty states.",
  "frontend/src/pages/ResidentialCertificateApplicationPage.tsx": "Implements the residential certificate application form with validation and submission handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters for routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for container queries and animations.",
  "project_state.json": "Stores project metadata, branding requirements, features, and architectural notes for a form‑based data collection website."
}